app/Controllers/UserCrud.php

    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function delete($cell = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('cell', $cell)->delete($cell);
---
DELETE FROM `users`
WHERE `cell` = '4431982010'
AND `cell` IN ('4431982010')